app/Jobs/Shopify/Sync/OneOrder.php

                            $total_shipping += $ship->price;
                        }
                        $db_order->subtotal_price = $current_subtotal_price;
                        $db_order->save();
---
update `orders` set `subtotal_price` = '1088.00', `total_price` = '1148.00' where `id` = 9975062069540

                            foreach($ref->refund_line_items as $key=>$line) {
                                if($line && isset($line->line_item_id))
                                {
                                    $refund = Refund::where('refund_id', json_decode($temp_payload['refunds'])[0]->id)->where('line_item_id',$line->line_item_id)->first();
---
select * from `refunds` where `refund_id` = 988348186916 and `line_item_id` = 31648502382884 limit 1

                                    $refund->quantity = $line->quantity;
                                    $refund->created_at = now();
                                    $refund->updated_at = now();
                                    $refund->save();
---
update `refunds` set `created_at` = '2025-04-08 10:37:17', `updated_at` = '2025-04-08 10:37:17' where `id` = 11741