app/Jobs/Shopify/Sync/Order.php

                        if ($this->table == "pending_orders")
                            $db_order = PendingOrder::where('id', $temp_payload['id'])->first();
                        else
                            $db_order = order2::where('id', $temp_payload['id'])->first();
---
select * from `orders` where `id` = 5785939050788 limit 1

                            $db_order->subtotal_price = $current_subtotal_price;

                            $db_order->payment_details = $transaction;
                            $db_order->save();
---
update `orders` set `subtotal_price` = '1455.00', `total_price` = '1515.00', `payment_details` = 'rxYR5A5LjyQsA911sUp3t9eea' where `id` = 9973307048228

                            foreach(json_decode($temp_payload['refunds']) as $key=>$ref)
                            {
                                if(isset($ref->refund_line_items[0]) && json_decode($temp_payload['refunds'])[0]) {
                                    $refund = Refund::where('refund_id', json_decode($temp_payload['refunds'])[0]->id)->where('line_item_id',$ref->refund_line_items[0]->line_item_id)->first();
---
select * from `refunds` where `refund_id` = 983375642916 and `line_item_id` = 14786963407140 limit 1

                                    $refund->quantity = $ref->refund_line_items[0]->quantity;
                                    $refund->created_at = now();
                                    $refund->updated_at = now();
                                    $refund->save();
---
update `refunds` set `created_at` = '2025-04-08 15:13:51', `updated_at` = '2025-04-08 15:13:51' where `id` = 10170