app/Http/Controllers/HomeController.php

    private function getDashboardPayload($user, $store,$data) {
        try {
            $orders = $store->getOrders();
            $orders = $orders->whereDate('created_at_date', now()->toDateString());
            $prepares = $store->getPrepares();
            $all_prepares = $prepares->whereDate('created_at', now()->toDateString())->get();
            $moderates = $store->getOrders()->where('channel','POS');
            $all_moderates = $moderates->whereDate('created_at', now()->toDateString());
            $prepare_users_list = [];
            $moderate_users_list = [];
            $prepare_users = User::where('role_id', '5')->get();
            $moderate_users = User::where('role_id', '6')->get();
---
select * from `prepares` where `prepares`.`store_id` = 1 and `prepares`.`store_id` is not null and date(`created_at`) = '2025-04-08'
select * from `users` where `role_id` = '5'
select * from `users` where `role_id` = '6'


                }
            }
            $activities = OrderHistory::orderBy('created_at','desc')->limit(10)->get();
            $mostSellingProducts = PrepareProductList::select('product_name','variant_image','price', DB::raw('COUNT(*) as total'))
            ->groupBy('product_name','variant_image','price')
            ->orderBy('total', 'desc')->limit(10)
            ->get();
            // dd($prepare_users_list);
            return [
                'orders_count' => $orders->count() ?? 0,
                'orders_revenue' => $orders->sum('total_price') ?? 0,
                'customers_count' => $store->getCustomers()->count() ?? 0,
                'recent_sales' => $orders->orderBy('created_at_date','desc')->limit(10)->get(),
                'reports' => $prepare_users_list,
                'reports2' => $moderate_users_list,
                'activities' => $activities,
                'most_selling' => $mostSellingProducts,
            ];
---
select * from `order_histories` order by `created_at` desc limit 10
select `product_name`, `variant_image`, `price`, COUNT(*) as total from `prepare_product_lists` group by `product_name`, `variant_image`, `price` order by `total` desc limit 10
select * from `orders` where `orders`.`store_id` = 1 and `orders`.`store_id` is not null and date(`created_at_date`) = '2025-04-08' order by `created_at_date` desc limit 10
select count(*) as aggregate from `orders` where `orders`.`store_id` = 1 and `orders`.`store_id` is not null and date(`created_at_date`) = '2025-04-08'
select count(*) as aggregate from `customers` where `customers`.`store_id` = 1 and `customers`.`store_id` is not null