app/Http/Controllers/ShopifyController.php

    public function orders(Request $request) {
        //Artisan::call('route:cache');
        $date = $request->date;
        $sort_search = null;
        $delivery_status = null;
        $payment_status = '';
        $prepare_users_list = [];
        $user = Auth::user();
        $city = $request->city;
        $store = $user->getShopifyStore;

        $cities = ShippingFee::pluck('city')->toArray();
---
select `city` from `shipping_fees`

    public function all_orders(Request $request) {
        $date = $request->date;
        $sort_search = null;
        $delivery_status = null;
        $payment_status = '';
        $prepare_users_list = [];
        $daterange = null;
        $prepare_staff = null;

        $user = Auth::user();
        $store = $user->getShopifyStore;

        $orders = $store->getPrepares();

        // $all_orders = Order2::select('fulfillment_status', \DB::raw('count(*) as total'))
        // ->where('store_id', 1)
        // ->groupBy('fulfillment_status')
        // ->pluck('total', 'fulfillment_status');

        $all_prepares = $orders->get();
---
select * from `prepares` where `prepares`.`store_id` = 1 and `prepares`.`store_id` is not null

    public function new_orders() {
        $user = Auth::user();
        $store = $user->getShopifyStore;
        if($user->id == 1 || $user->id == 2)
        $orders = $store->getPrepares()->where('delivery_status','distributed')->orderBy('table_id', 'desc')
                ->paginate(15);
        else
        $orders = $store->getPrepares()->where('delivery_status','distributed')
                ->where('assign_to',$user->id)->orderBy('table_id', 'asc')
                ->paginate(15);
---
select * from `prepares` where `prepares`.`store_id` = 1 and `prepares`.`store_id` is not null and `delivery_status` = 'distributed' and `assign_to` = 77 order by `table_id` asc limit 15 offset 0
select count(*) as aggregate from `prepares` where `prepares`.`store_id` = 1 and `prepares`.`store_id` is not null and `delivery_status` = 'distributed' and `assign_to` = 77

    public function hold_orders() {
        $user = Auth::user();
        $store = $user->getShopifyStore;
        if($user->id == 1 || $user->id == 2)
        $orders = $store->getPrepares()->where('delivery_status','hold')->orderBy('table_id', 'desc')
                ->paginate(15);
        else
        $orders = $store->getPrepares()->where('delivery_status','hold')
                ->where('assign_to',$user->id)->orderBy('table_id', 'desc')
                ->paginate(15);
---
select * from `prepares` where `prepares`.`store_id` = 1 and `prepares`.`store_id` is not null and `delivery_status` = 'hold' and `assign_to` = 77 order by `table_id` desc limit 15 offset 15
select count(*) as aggregate from `prepares` where `prepares`.`store_id` = 1 and `prepares`.`store_id` is not null and `delivery_status` = 'hold' and `assign_to` = 77

    public function staff_report(Request $request)
    {
        $date = $request->date;
        $sort_search = null;
        $delivery_status = null;
        $prepare_users_list = [];
        $daterange = null;

        $user = Auth::user();
        $store = $user->getShopifyStore;
        $orders = $store->getPrepares();


        if($request->delivery_status) {
            $delivery_status = $request->delivery_status;
            $orders = $orders->where('delivery_status', $delivery_status);

        }
        if ($request->search) {
            $sort_search = $request->search;
            $orders = $orders->where('delivery_status', 'like', '%' . $sort_search . '%')
                ->orWhereHas('user', function ($q)use($sort_search) {
                    return $q->where('name', 'like', '%' . $sort_search . '%');
                });
---
select * from `prepares` where `prepares`.`store_id` = 1 and `prepares`.`store_id` is not null and date(`created_at`) >= '2025-04-08' and date(`created_at`) <= '2025-04-08'


        $all_prepares = $orders->get();

        $prepare_users = User::where('role_id', '5')->get();
---
select * from `users` where `role_id` = '5'

    public function prepareOrder($id)
    {
        $user = Auth::user();
        $store = $user->getShopifyStore;
        $order = order2::where('order_number','like','%'. $id.'%')->first();
        if(!$order)
        $order = Sale::where('order_number','like','%'. $id.'%')->first();

        if ($user->role_id == 6 && $order->fulfillment_status != "shipped")
            return redirect()->back()->with('errors',"Youre not permitted to view this page");

        $product_images = $store->getProductImagesForOrder($order);

        $prepare = Prepare::where('order_id', $order->id)->first();
        if (!$prepare)
            $prepare = $this->createPrepare($order);

        $prepare_products = PrepareProductList::where('prepare_id', $prepare->id)->first();
        $refunds = Refund::where('order_name', $order->name)->get();

        $returns = ReturnedOrder::where('order_number', $order->order_number)->get();
---
select * from `prepares` where `order_id` = 9971720323364 limit 1
select * from `prepare_product_lists` where `prepare_id` = 74268 limit 1
select * from `refunds` where `order_name` = '#64279'
select * from `returned_orders` where `order_number` = '64279'

    public function assignOrders($id,$prepare_emp)
    {
        $prepare_employee = User::find($prepare_emp);
        $order = order2::find($id);

        $user = Auth::user();
        $store = $user->getShopifyStore;
        if ($order != null) {

                try {
                    $order = order2::where('id',$id)->first();
                    $order->status = "3";
                    $order->fulfillment_status = "distributed";
                    $order->save();

                    // Add TO Prepare
                    //firstornew
                    $add_to_prepare = Prepare::where('order_id',$order->id)->first();
---
select * from `users` where `users`.`id` = '76' limit 1
update `orders` set `fulfillment_status` = 'distributed', `status` = '3' where `id` = 9975489495332
select * from `prepares` where `order_id` = 9975489495332 limit 1

    public function createPrepare($order,$prepare_emp=1)
    {
        $user = Auth::user();
        $store = $user->getShopifyStore;

        $add_to_prepare = Prepare::where('order_id', $order->id)->first();
        if(!$add_to_prepare)
        $add_to_prepare = new Prepare();

        $add_to_prepare->order_id  = $order->id;
        $add_to_prepare->store_id  = $order->store_id;
        $add_to_prepare->table_id  = $order->table_id;
        $add_to_prepare->assign_by  = Auth::user()->id;
        $add_to_prepare->assign_to  = $prepare_emp;
        $add_to_prepare->status  = "3";
        $add_to_prepare->delivery_status  = $order->fulfillment_status;
        $add_to_prepare->sale_created_at  = $order->created_at_date;
        $add_to_prepare->created_at  = now();
        $add_to_prepare->updated_at  = now();
        $add_to_prepare->save();
        $prepare_product = PrepareProductList::where('order_id',$order->id)->delete();
---
select * from `prepares` where `order_id` = 9975489495332 limit 1
insert into `prepares` (`order_id`, `store_id`, `table_id`, `assign_by`, `assign_to`, `status`, `delivery_status`, `sale_created_at`, `created_at`, `updated_at`) values (9975489495332, 1, 86606, 32, '76', '3', 'distributed', '2025-04-08 10:09:25', '2025-04-08 08:22:54', '2025-04-08 08:22:54')
delete from `prepare_product_lists` where `order_id` = 9975489495332

    public function review_order($id)
    {
        $order = order2::where('id', $id)->first();
        $prepare = Prepare::where('order_id', $id)->first();
        if (!$prepare)
            $prepare = $this->createPrepare($order);
        $order_currency=getCurrencySymbol($order->currency);
        $user = Auth::user();
        $store = $user->getShopifyStore;
        $product_images = $store->getProductImagesForOrder($order);
        $refunds = Refund::where('order_name', $order->name)->get();
---
select * from `prepares` where `order_id` = '9974757228836' limit 1
select * from `refunds` where `order_name` = '#65005'

    public function review_post(Request $request)
    {
        $data = $request->all();
        $auth_id = auth()->user()->id;
        $auth_user = auth()->user()->name;
        $user = Auth::user();
        $store = $user->getShopifyStore;

        $order = order2::where('order_number', $request['order_id'])->first();
        $prepare = Prepare::where('order_id', $order->id)->first();
        if (!$prepare)
            $prepare = $this->createPrepare($order);
        $refunds = Refund::where('order_name', $order->name)->get();

        if($order->getFulfillmentOrderDataInfo()->doesntExist()){
            OrderFulfillments::dispatchNow($user, $store, $order);

        }
        if($order)
        {
            $order->fulfillment_status = "reviewed";
            $order->status = 8;
            $order->save();
            $data['name'] = $order->name;
        }
        if($prepare)
        {
            $prepare->delivery_status = 'reviewed';
            $prepare->save();
---
select * from `prepares` where `order_id` = 9974215704868 limit 1
select * from `refunds` where `order_name` = '#64874'
select * from `orders` where `order_number` = '64874' limit 1
update `orders` set `fulfillment_status` = 'reviewed', `status` = 8 where `id` = 9974215704868
update `prepares` set `delivery_status` = 'reviewed' where `id` = 75387

        $posted_data2 = [];
        foreach ($request['line_item_id'] as $key => $item) {
            $quantity = 0;
            $prepare_product = PrepareProductList::where('product_id', $item)->where('order_id', $order->id)->first();
---
select * from `prepare_product_lists` where `product_id` = '31648502382884' and `order_id` = 9974215704868 limit 1

                if ($prepare->delivery_status != "fulfilled")
                {
                    $prepare->delivery_status = 'fulfilled';
                    $prepare->save();
---
update `prepares` set `delivery_status` = 'fulfilled' where `id` = 75387

                {
                    $order->fulfillment_status = "fulfilled";
                    $order->status = 10;
                    $order->save();
---
update `orders` set `fulfillment_status` = 'fulfilled', `status` = 10 where `id` = 9974215704868

    public function bulk_order_review(Request $request)
    {
        //$sale_id = [63683];
        $sale_id = $request['id'];
        $same_client = [];
        $clients = [];
        $success_orders = [];
        $ids = [];
        if($sale_id == [] || !$sale_id)
                return redirect()->back()->with('errors','No Orders Selected');
        foreach ($sale_id as $id) {
            try{
                $sale_data = order2::where('id',$id)->first();
                $sale_prepare_data = Prepare::where('order_id', $sale_data->id)->first();
---
select * from `prepares` where `order_id` = 9975103324452 limit 1

    public function generate_invoice($id)
    {
        $order = order2::find($id);
        if(!$order)
        $order = Sale::find($id);
        $refunds = Refund::where('order_name', $order->name)->pluck('line_item_id')->toArray();
        $order_details = PrepareProductList::where('order_id', $id)->where('table_id', $order->table_id)->whereNotIn('product_id',$refunds)->get();
---
select `line_item_id` from `refunds` where `order_name` = '#64457'
select * from `prepare_product_lists` where `order_id` = '9972657750308' and `table_id` = 85810 and 1 = 1

    public function order_history($id)
    {
        $order = order2::findOrFail($id);

        $order_history = OrderHistory::where('order_id',$id)->get();
        $order_shipping_address = $order->shipping_address;
        $ticket_history = TicketHistory::where('order_id',$order->order_number)->get();
---
select * from `order_histories` where `order_id` = '9975464591652'
select * from `ticket_histories` where `order_id` = '65133'

    public function update_delivery_status(Request $request)
    {
        if($request->status == 'cancelled') {
            $user = Auth::user();
            $store = $user->getShopifyStore;
            $order = order2::findOrFail($request->order_id);
            $order->fulfillment_status = $request->status;
            $order->status = '14';


            $order->save();
            $get_prepare_order = Prepare::where('order_id',$order->id)->first();

            if($get_prepare_order){

                $get_prepare_order->delete();
                $get_prepare_order_details = PrepareProductList::where('order_id',$order->id)->get();
                if(count($get_prepare_order_details)){
                    foreach ($get_prepare_order_details as $detail) {
                        $detail_record = PrepareProductList::find($detail->id);
                        $detail_record->delete();
---
select * from `orders` where `orders`.`id` = '9974510223652' limit 1
update `orders` set `fulfillment_status` = 'cancelled', `status` = '14' where `id` = 9974510223652
select * from `prepares` where `order_id` = 9974510223652 limit 1
delete from `prepares` where `id` = 75137
select * from `prepare_product_lists` where `order_id` = 9974510223652
select * from `prepare_product_lists` where `prepare_product_lists`.`id` = 252157 limit 1
delete from `prepare_product_lists` where `id` = 252157

    public function fulfillOrderItems(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'product_status.*' => 'required',]
            , [
                'product_status.*.required' => 'This field is required.',
            ]);

        if ($validator->fails()) {
            return redirect()->back()->withErrors($validator)->withInput();
        }
        $request = $request->all();
        $posted_data = [];
        $user = Auth::user();
        $store = $user->getShopifyStore;
        $order = $store->getOrders()->where('table_id', (int) $request['order_id'])->first();
        $prepare = $store->getPrepares()->where('table_id',(int) $request['order_id'])->first();
        if ($prepare->delivery_status == "hold")
            $old_page = "prepare.hold";
        else
            $old_page = "prepare.new";
        $prepare->delivery_status = "prepared";
        $order->fulfillment_status = "prepared";
        foreach($request['line_item_id'] as $key => $item)
        {
            $prepare_product = PrepareProductList::where('product_id', $item)->where('order_id', $order->id)->first();
---
select * from `orders` where `orders`.`store_id` = 1 and `orders`.`store_id` is not null and `table_id` = 86611 limit 1
select * from `prepares` where `prepares`.`store_id` = 1 and `prepares`.`store_id` is not null and `table_id` = 86611 limit 1
select * from `prepare_product_lists` where `product_id` = '31650933768484' and `order_id` = 9975527309604 limit 1

                $history->note = "Product has been marked "."Prepared";
                $history->created_at = now();
                $history->updated_at = now();
                $history->save();
            }
            else{
                $product_variant = ProductVariant::where('sku', $prepare_product->product_sku)->first();
                if($product_variant)
                {
                    $branches = BranchVariant::where('variant_id',$product_variant->id) // still eager load the branch relationship
                    ->get();
---
insert into `user_histories` (`user_id`, `product_id`, `order_id`, `action`, `note`, `created_at`, `updated_at`) values (14, 252992, '9975527309604', 'Prepared', 'Product has been marked Prepared', '2025-04-08 09:57:00', '2025-04-08 09:57:00')
select * from `product_variants` where `sku` = '10522323000200' limit 1
select * from `branch_variants` where `variant_id` = 49913700450596

                        $history->note = "Product has been marked NA";
                        $history->created_at = now();
                        $history->updated_at = now();
                        $history->save();
---
insert into `user_histories` (`user_id`, `product_id`, `order_id`, `action`, `note`, `created_at`, `updated_at`) values (14, 252996, '9975527309604', 'NA', 'Product has been marked NA', '2025-04-08 09:57:01', '2025-04-08 09:57:01')

                        $history->note = "Product has been marked ".$request['product_status'][$key];
                        $history->created_at = now();
                        $history->updated_at = now();
                        $history->save();
---
insert into `user_histories` (`user_id`, `product_id`, `order_id`, `action`, `note`, `created_at`, `updated_at`) values (14, 252991, '9975527309604', 'hold', 'Product has been marked hold', '2025-04-08 09:57:00', '2025-04-08 09:57:00')

            }
            $prepare_product->save();
        }
        $order->save();
        $prepare->save();
---
update `orders` set `fulfillment_status` = 'hold' where `id` = 9975527309604
update `prepares` set `delivery_status` = 'hold', `updated_at` = '2025-04-08 09:57:01' where `id` = 75379

            $add_History_sale->save();
        }
        else{
            $prepare_product = PrepareProductList::whereIn('product_id', $request['line_item_id'])->where('order_id', $order->id)->get();
---
select * from `prepare_product_lists` where `product_id` in ('31650933768484', '31650933801252', '31650933834020', '31650933866788', '31650933899556', '31650933932324', '31650933965092', '31650933997860') and `order_id` = 9975527309604

    public function searchReadyOrders(Request $request)
    {

        $orders = isset($request->orders) ? $request->orders : [];
        $orderNumber = $request->input('order_number');
        $number = str_replace('Lvs','',$orderNumber);
        $number = str_replace('lvs','',$number);
        $number = str_replace(' ','',$number);
        $order = order2::where('fulfillment_status','fulfilled')->whereNotIn('order_number',$orders)->where('order_number', (int)$number)->first();
---
select * from `orders` where `fulfillment_status` = 'fulfilled' and `order_number` not in ('64940', '64267', '63766', '64875', '65073', '64754', '64734', '64411', '65080', '64999', '62584', '64317', '65056', '64894', '65051', '64860', '63529', '64137', '64790', '64777', '65094', '65135', '64974', '65071', '64882', '64294', '64217', '63591', '63313', '64622', '63947', '63850', '64673', '64692', '64809', '64798', '65179', '64122', '64588', '64881', '65216', '65098', '64855', '64744', '64572', '63847') and `order_number` = 64727 limit 1