app/Http/Controllers/TicketController.php

select * from `users` where `role_id` in (6, 7, 8)
---
            $q->where('type', 'complaint');
        })->count();

        $users = User::whereIn('role_id', [6, 7, 8])->get();

select * from `ticket_user` where `status` in ('open', 'in progress') order by `created_at` desc
select * from `tickets` where `tickets`.`id` in (1, 2)
select * from `users` where `users`.`id` in (10, 18, 20, 51, 52, 57, 58, 59, 60, 61, 64, 65, 66, 67, 68, 69, 70, 75)
---
    public function new(Request $request)
    {
        // Fetch only tickets with 'open' or 'in progress' status
        $query = TicketUser::with(['ticket', 'user'])
                    ->whereIn('status', ['open', 'in progress']);

                    // Apply filters for the tickets
        if ($request->filled('order_number')) {
            $query->where('order_number', $request->order_number);
        }

        if ($request->filled('reason')) {
            $query->where('content', $request->reason);
        }

        if ($request->filled('ticket_type')) {
            $query->whereHas('ticket', function ($q) use ($request) {
                $q->where('type', $request->ticket_type);
            });
        }

        if ($request->filled('status')) {
            $query->where('status', $request->status);
        }

        if ($request->filled('start_date')) {
            $query->where('created_at', '>=', $request->start_date);
        }

        if ($request->filled('end_date')) {
            $query->where('created_at', '<=', $request->end_date);

select * from `ticket_user` where `ticket_user`.`id` = '5530' limit 1
update `ticket_user` set `status` = 'in progress', `ticket_user`.`updated_at` = '2025-04-08 14:13:57' where `id` = 5530
insert into `ticket_histories` (`user_id`, `ticket_id`, `order_id`, `action`, `note`) values (51, 5530, '62789', 'Open', 'Ticket has been Opened')
---
    public function open($ticketUserId)
    {
        // Find the specific record in the pivot table
        $ticketUser = TicketUser::find($ticketUserId);

        if ($ticketUser) {
            // Change status to 'in_progress'
            $ticketUser->status = 'in progress';
            $ticketUser->save();

            $ticketHistory = new TicketHistory();
            $ticketHistory->user_id = auth()->id();
            $ticketHistory->ticket_id = $ticketUser->id;
            $ticketHistory->order_id = $ticketUser->order_number;
            $ticketHistory->action = "Open";
            $ticketHistory->note= "Ticket has been Opened";
            $ticketHistory->save();

select * from `comments` where `comments`.`ticket_user_id` in (5255)
select * from `ticket_user` where `ticket_user`.`id` = '5255' limit 1
select * from `users` where `users`.`id` in (20, 60)
---
    public function show($ticketUserId)
    {
        // Find the specific ticket user
        $ticketUser = TicketUser::with('comments.user')->find($ticketUserId);

select * from `ticket_user` where `ticket_user`.`id` = '5421' limit 1
---
    public function updateStatus(Request $request, $ticketUserId)
{
    $ticketUser = TicketUser::findOrFail($ticketUserId);

update `ticket_user` set `status` = 'done', `is_closed` = 1, `is_hold` = 0, `ticket_user`.`updated_at` = '2025-04-08 10:36:19' where `id` = 5462
---
// Only save if a valid action was provided
if (isset($commentText)) {
    // Save the ticket status update
    $ticketUser->save();

select * from `ticket_user` where `ticket_user`.`id` = 5421 limit 1
---
public function confirmReturn(Request $request,$return = false)
{
    $ticket = TicketUser::find($request->ticket_id);

insert into `comments` (`body`, `user_id`, `ticket_user_id`, `updated_at`, `created_at`) values ('تم الاسترجاع بنجاح', 66, 5052, '2025-04-08 14:29:35', '2025-04-08 14:29:35')
---
            $comment->body = $commentText;
            $comment->user_id = auth()->id();
            $comment->ticket_user_id = $ticket->id;
            $comment->save();

insert into `ticket_histories` (`user_id`, `ticket_id`, `order_id`, `action`, `note`) values (66, 5052, '61500', 'Done and Return', 'Return Request has been Confirmed By Shipping on This Order and Ticket Marked Done')
---
            $ticketHistory->order_id = $ticket->order_number;
            $ticketHistory->action = "Done and Return";
            $ticketHistory->note= "Return Request has been Confirmed By Shipping on This Order and Ticket Marked Done";
            $ticketHistory->save();

select * from `orders` where `order_number` = '63613' limit 1
---

        $order_number = $ticket->order_number;

        $order = Order::where('order_number',$order_number)->first();

update `ticket_user` set `status` = 'done', `is_asked_to_return` = 1, `is_returned` = 0 where `id` = 5421
---
            {
                DB::beginTransaction();

                DB::table('ticket_user')
                    ->where('id', $ticket->id)
                    ->update([
                        'status' => 'done', // Update status to 'done'
                        'is_asked_to_return' => 1, // Update is_asked_to_return to 1
                        'is_returned' => 0, // Ensure the updated_at timestamp is also updated
                    ]);

insert into `ticket_histories` (`user_id`, `ticket_id`, `order_id`, `action`, `note`) values (51, 5421, '63613', 'Ask to Return', 'Return Request has been Created By Levoile on This Order and Pending Shipping Confirmation')
---
                $ticketHistory->order_id = $ticket->order_number;
                $ticketHistory->action = "Ask to Return";
                $ticketHistory->note= "Return Request has been Created By Levoile on This Order and Pending Shipping Confirmation";
                $ticketHistory->save();

insert into `comments` (`body`, `user_id`, `ticket_user_id`, `updated_at`, `created_at`) values ('برجاء استرجاع الطلب', 51, 5421, '2025-04-08 11:36:52', '2025-04-08 11:36:52')
---
                $comment->body = $commentText;
                $comment->user_id = auth()->id();
                $comment->ticket_user_id = $ticket->id;
                $comment->save();

insert into `returned_orders` (`type`, `order_id`, `order_number`, `note`, `shipping_on`, `status`, `user_id`, `created_at`, `updated_at`) values ('online', 9967474671908, '63613', 'Redirect From Ticket', 'client', 'In Progress', 51, '2025-04-08 11:36:51', '2025-04-08 11:36:51')
---
    public function return_order($request)
    {
        $return = new ReturnedOrder();
        $order = $request->order;
        if($order) {
            if($order->note=="Point of Sale" || $order->note=="Point of Sale")
            $return->type = "pos";
            else
            $return->type = "online";
            $return->order_id = $order->id;
            $return->order_number = $order->order_number;
            $return->note = "Redirect From Ticket";
            $return->shipping_on = "client";
            $return->status = "In Progress";
            $return->user_id = auth()->user()->id;
            $return->created_at = now();
            $return->updated_at = now();
            $return->save();

select * from `prepares` where `order_id` = 9967474671908 limit 1
---
            $return_items = $request->items;
            if(isset($request->all) && $request->all == "all")
            {
                $prepare = Prepare::where('order_id', $order->id)->first();

select * from `tickets` where `type` = 'request' limit 1
insert into `ticket_user` (`user_id`, `ticket_id`, `status`, `order_number`, `content`, `updated_at`, `created_at`) values (58, 1, 'open', '63206', 'other', '2025-04-08 15:57:21', '2025-04-08 15:57:21')
---
    public function store(Request $request)
    {
        // Validate the incoming request data
        $validated = $request->validate([
            'order' => 'required',
            'ticket_type' => 'required',
            'reason' => 'required',
            'content' => 'required'
        ]);
        // Format the reason and combine it with the content
        $reasonFormatted = str_replace('_', ' ', $validated['reason']);
        // $combinedContent = $reasonFormatted . ' - ' . $validated['content'];
        $user = auth()->user(); // Get the authenticated user

        // Fetch the ticket using the first() method instead of pluck()
        $ticket = Ticket::where('type', $validated['ticket_type'])->first();

        $orderNumber = str_replace('Lvs','',$validated['order']);
        $orderNumber = str_replace('lvs','',$orderNumber);

        // Check if the ticket exists before attaching
        if ($ticket) {
            // Attach the user to the ticket in the pivot table
            $ticketUser = TicketUser::create([
                'user_id' => $user->id,
                'ticket_id' => $ticket->id,
                'status' => 'open',           // Status for the pivot record
                'order_number' => $orderNumber, // Order number from the request
                'content' => $validated['reason']  // Combined content for the pivot record
            ]);

insert into `comments` (`ticket_user_id`, `body`, `user_id`, `updated_at`, `created_at`) values (5564, 'افاد الفرع ان  الهاتف لا يرد وسيتم التواصل واتساب', 58, '2025-04-08 15:57:21', '2025-04-08 15:57:21')
---
            $comment->ticket_user_id = $ticketUserId; // Use the correct ticket_user_id
            $comment->body = $validated['content'];
            $comment->user_id = $user->id;
            $comment->save();

insert into `ticket_histories` (`user_id`, `ticket_id`, `order_id`, `action`, `note`) values (58, 5564, '63206', 'Create', 'a new Ticket has been Added to this Order')
---
            $ticketHistory->order_id = $ticketUser->order_number;
            $ticketHistory->action = "Create";
            $ticketHistory->note= "a new Ticket has been Added to this Order";
            $ticketHistory->save();