app/Models/Store.php

    public function getProductImagesForOrder($order) {
        try {
            $products_images = [];
            $product_ids = $order->getProductIdsForLineItems();
            $products = null;
            if($product_ids !== null && count($product_ids) > 0) {
                $products = $this->getProducts()->whereIn('id', $product_ids)->select(['id', 'images'])->get();
---
select `id`, `images` from `products` where `products`.`store_id` = 1 and `products`.`store_id` is not null and `id` in (9115103723812)