app/Providers/NotificationServiceProvider.php

select count(*) as aggregate from `comments` where `user_id` = 66 and `read_at` is null
---
    public function boot()
    {
        // Using View Composer to share data with the 'layouts.nav' view
        View::composer('layouts.nav', function ($view) {
            $currentUser = auth()->user(); // Get the currently authenticated user
            $tickets = collect(); // Initialize tickets collection
            $notificationMessage = null; // Initialize notification message
            $ticketUserId = null; // Initialize ticket user ID
            $commentdate = null; // Initialize comment date
            $newNotification = null; // Initialize new notification variable

            // Fetch tickets based on user role
            if ($currentUser) {
                $tickets = $this->fetchUserTickets($currentUser); // Fetch tickets for the current user
            }

            // Count unread comments for the current user
            $unreadCommentsCount = Comment::where('user_id', $currentUser->id)
                ->whereNull('read_at')
                ->count();

select * from `ticket_user` where exists (select * from `users` where `ticket_user`.`user_id` = `users`.`id` and `role_id` = 7) and `read_at` is null
---
    protected function fetchUserTickets($currentUser)
    {
        if ($currentUser->role_id == 7) {
            // Fetch tickets added by users with role 8 using eager loading
            return TicketUser::with(['ticket', 'user'])
                ->whereHas('user', function ($query) {
                    $query->where('role_id', 8);
                })
                ->whereNull('read_at') // Only get unread tickets
                ->get();
        } elseif ($currentUser->role_id == 8) {
            // Fetch tickets added by users with role 7 using eager loading
            return TicketUser::with(['ticket', 'user'])
                ->whereHas('user', function ($query) {
                    $query->where('role_id', 7);
                })
                ->whereNull('read_at') // Only get unread tickets
                ->get();